Обучение_8310/src/Documents/Поступление/Поступление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Поступление</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВазиморасчетыСКонтрагентом</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Обучение_8310/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.Характеристика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Обучение_8310/src/AccumulationRegisters/ВазиморасчетыСКонтрагентом/ВазиморасчетыСКонтрагентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВазиморасчетыСКонтрагентом</name>
  <resources>
    <name>Сумма</name>
    <comment>Долг контрагента перед нами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Обучение_8310/src/Documents/Поступление/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// формируем движения регистра ОстаткиТоваров
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТабличнаяЧасть.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Количество;
	КонецЦикла;

	// формируем движения регистра ВазиморасчетыСКонтрагентом
	Движения.ВазиморасчетыСКонтрагентом.Очистить();
	Движения.ВазиморасчетыСКонтрагентом.Записывать = Истина;
	Движение = Движения.ВазиморасчетыСКонтрагентом.Добавить();	
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;		
	Движение.Сумма = ТабличнаяЧасть.Итог("Сумма");
	
	// запись движений	
	Движения.ВазиморасчетыСКонтрагентом.Записать();		
	Движения.ОстаткиТоваров.Записать();	

				
КонецПроцедуры
